controllers/LoginController.php

DELETE FROM `entry` WHERE `id`='6'
---
    public function actionDelete(){
        $id=Yii::$app->request->get('id');
        $rs=Yii::$app
                ->db
                ->createCommand()
                ->delete(Entry::tableName(),['id'=>$id])
                ->execute();